//#include <iostream>
//using namespace std;
//
//int main() {
//	int j = 5;
//	int k = 5;
//
//	int s;
//
//	int R;
//	int C;
//
//
//
//	cout << "x축 값을 입력하세요:";
//	cin >> j;
//	cout << "y축 값을 입력하세요:";
//	cin >> k;
//
//
//	cout << endl << "----------------1번과제-------------" << endl;
//
//	for (C = 0; C < k; C++)
//	{
//
//		for (R = 0; R < j; R++)
//		{
//			cout << "*";
//		}
//		cout << endl;
//	}
//	cout << "------------------------------------" << endl << endl;
//
//
//
//	cout << endl << "----------------2번과제-------------" << endl;
//
//
//
//	for (C = 0; C < k + 1; C++)//k는 세로값 ex)5
//	{
//
//		for (R = j; R > k - C; R--)//j는 가로값 ex)5
//		{
//
//			cout << "*";
//		}
//		cout << endl;
//	}
//	cout << "------------------------------------" << endl << endl;
//
//
//	cout << endl << "----------------3번과제-------------" << endl;
//
//
//
//	for (C = 0; C < k; C++)//k는 세로값 ex)5
//	{
//
//		for (s = 0; s < C; s++)
//		{
//			cout << " ";
//		}
//
//
//		for (R = 0; R < j - C; R++)//j는 가로값 ex)5
//		{
//
//			cout << "*";
//		}
//
//
//
//		cout << endl;
//	}
//	cout << endl << "------------------------------------" << endl << endl;
//
//	cout << endl << "----------------4번과제-------------" << endl;
//
//	for (C = k - j; C < k; C++)//k는 세로값 ex)5
//	{
//
//		for (s = k - 1; C < s; s--)
//		{
//			cout << " ";
//		}
//
//
//		for (R = 0; R < C + 1 + (j - k); R++)//j는 가로값 ex)5
//		{
//
//			cout << "*";
//		}
//
//
//
//		cout << endl;
//	}
//	cout << endl << "------------------------------------" << endl << endl;
//
//	cout << endl << "----------------5번과제-------------" << endl;
//
//	for (C = 0; C < j; C++)//k는 세로값 ex)5
//	{
//
//
//
//		for (k = j - 1; k > C; k--)//j는 가로값 ex)5
//		{
//
//			cout << " ";
//		}
//
//		for (R = 0; R < 2 * C + 1; R++)//j는 가로값 ex)5
//		{
//
//			cout << "*";
//		}
//
//
//
//		cout << endl;
//
//	}
//	cout << "------------------------------------" << endl << endl;
//
//	cout << endl << "----------------6번과제-------------" << endl;
//
//	for (C = 0; C < k + 1; C++)//k는 세로값 ex)5
//	{
//
//		for (j = 0; j < C; j++)
//		{
//
//			cout << " ";
//
//		}
//
//
//
//		for (R = 2 * k - 1; R + 2 > C * 2; R--)//j는 가로값 ex)5
//		{
//			cout << "*";
//		}
//
//
//		cout << endl;
//	}
//	cout << "-------------------------------" << endl << endl;
//
//	return 0;
//}

